Repository: EkaterinePapava/tre
Catalog: po/*.po
Languages: ka

source: No error
ka: შეცდომების გარეშე

source: No match
ka: დამთხვევა არ არის

source: Invalid regexp
ka: არასწორი რეგულარული გამოსახულება

source: Unknown collating element
ka: უცნობი კოლაციის ელემენტი

source: Unknown character class name
ka: უცნობი სიმბოლოს კლასის სახელი

source: Trailing backslash
ka: ბოლო Backslash

source: Invalid back reference
ka: არასწორი უკუბმა

source: Missing ']'
ka: აკლია ']'

source: Missing ')'
ka: აკლია ')'

source: Missing '}'
ka: აკლია '}'

source: Invalid contents of {}
ka: {}-ის შემცველობა არასწორია

source: Invalid character range
ka: არასწორი სიმბოლოების შუალედი

source: Out of memory
ka: არასაკმარისი მეხსიერება

source: Invalid use of repetition operators
ka: გამეორების ოპერატორების არასწორი გამოყენება

source: Maximum repetition in {} larger than
ka: მაქსიმალური გამეორება {}-ში უფრო დიდია, ვიდრე

source: Unknown error
ka: უცნობი შეცდომა

source: Usage: %s [OPTION]... PATTERN [FILE]...
ka: გამოყენება: %s [პარამეტრი]... ნიმუში [ფაილი]...

source: Try `%s --help' for more information.
ka: მეტი ინფორმაციისთვის სცადეთ '%s --help'

source: Searches for approximate matches of PATTERN in each FILE or standard input. Example: `%s -2 optimize foo.txt' outputs all lines in file `foo.txt' that match "optimize" within two errors. E.g. lines which contain "optimise", "optmise", and "opitmize" all match.
ka: ეძებს PATTERN-ის მიახლოებით დამთხვევებს თითოეულ FILE-ში ან სტანდარტულ შეყვანაში. მაგალითი: „%s -2 optimize foo.txt“ გამოიტანს ყველა სტრიქონს „foo.txt“ ფაილიდან, რომელიც ემთხვევა სიტყვას „optimize“ მაქსიმუმ ორი შეცდომის ფარგლებში. მაგალითად, სტრიქონები, რომლებიც შეიცავს „optimise“-ს, „optmise“-ს და „opitmize“-ს, ყველა ჩაითვლება დამთხვევად.

source: Regexp selection and interpretation: -e, --regexp=PATTERN use PATTERN as a regular expression -i, --ignore-case ignore case distinctions -k, --literal PATTERN is a literal string -w, --word-regexp force PATTERN to match only whole words Approximate matching settings: -D, --delete-cost=NUM set cost of missing characters -I, --insert-cost=NUM set cost of extra characters -S, --substitute-cost=NUM set cost of wrong characters -E, --max-errors=NUM select records that have at most NUM errors -# select records that have at most # errors (# is a digit between 0 and 9) Miscellaneous: -d, --delimiter=PATTERN set the record delimiter regular expression -v, --invert-match select non-matching records -V, --version print version information and exit -y, --nothing does nothing (for compatibility with the non-free agrep program) --help display this help and exit Output control: -B, --best-match only output records with least errors -c, --count only print a count of matching records per FILE -h, --no-filename suppress the prefixing filename on output -H, --with-filename print the filename for each match -l, --files-with-matches only print FILE names containing matches -M, --delimiter-after print record delimiter after record if -d is used -m, --max-count=NUM stop after NUM selected lines -n, --record-number print record number with output --line-number same as -n -q, --quiet, --silent suppress all normal output -s, --show-cost print match cost with output --colour, --color use markers to distinguish the matching strings --show-position prefix each output record with start and end position of the first match within the record
ka: რეგულარული გამოსახულების შერჩევა და ინტერპრეტაცია: -e, --regexp=PATTERN PATTERN-ის გამოყენება როგორც რეგულარული გამოსახულების -i, --ignore-case დიდი და პატარა ასოების არგანსხვავება -k, --literal PATTERN არის ლიტერალური სტრიქონი -w, --word-regexp აიძულე PATTERN, დაემთხვეს მხოლოდ მთლიან სიტყვებს მიახლოებითი დამთხვევის პარამეტრები: -D, --delete-cost=NUM ნაკლული სიმბოლოების ფასის დაყენება -I, --insert-cost=NUM ზედმეტი სიმბოლოს ფასის დაყენება -S, --substitute-cost=NUM არასწორი სიმბოლოს ფასის დაყენება -E, --max-errors=NUM მაქს NUM შეცდომის მქონე ჩანაწერების არჩევა -# შეარჩიე ჩანაწერები, რომლებსაც აქვთ მაქსიმუმ # შეცდომა (# არის ციფრი 0-დან 9-მდე) სხვადასხვა: -d, --delimiter=PATTERN ჩანაწერის გამყოფის რეგულარული გამოსახულების მითითება -v, --invert-match შეარჩიე ჩანაწერები, რომლებიც არ ემთხვევა შაბლონს -V, --version ვერსიის ინფორმაციის ჩვენება და გასვლა -y, --nothing არაფერს აკეთებს (არათავისუფალ პროგრამა agrep-თან თავსებადობისთვის) --help ამ დახმარების ჩვენება და გამოსვლა გამოტანის კონტროლი: -B, --best-match მხოლოდ მინიმალური შეცდომების მქონე ჩანაწერების გამოტანა -c, --count მხოლოდ დამთხვეული ჩანაწერების რაოდენობის ჩვენება თითოეულ FILE-ზე -h, --no-filename გამონატანში ფაილის სახელის პრეფიქსის გაუქმება -H, --with-filename ფაილის სახელის ჩვენება თითოეული დამთხვევისთვის -l, --files-with-matches მხოლოდ იმ FILE-ების სახელების ჩვენება, რომლებიც შეიცავენ დამთხვევებს -M, --delimiter-after ჩანაწერის გამყოფის ჩვენება ჩანაწერის შემდეგ, თუ გამოიყენება -d -m, --max-count=NUM შეჩერდი NUM რაოდენობის შერჩეული სტრიქონის შემდეგ -n, --record-number ჩანაწერის ნომრის ჩვენება გამონატანთან ერთად --line-number იგივე, რაც -n -q, --quiet, --silent ყველა ჩვეულებრივი გამონატანის გაუქმება -s, --show-cost დამთხვევის „ფასის“ ჩვენება გამონატანთან ერთად --colour, --color მარკერების გამოყენება დამთხვეული სტრიქონების გამოსაყოფად --show-position თითოეული გამონატანი ჩანაწერისთვის პირველი დამთხვევის საწყისი და საბოლოო პოზიციის მითითება

source: With no FILE, or when FILE is -, reads standard input. If less than two FILEs are given, -h is assumed. Exit status is 0 if a match is found, 1 for no match, and 2 if there were errors. If -E or -# is not specified, only exact matches are selected.
ka: FILE-ის მითითების გარეშე, ან როდესაც FILE არის -, იკითხება სტანდარტული შეყვანა. თუ მითითებულია ორზე ნაკლები FILE, იგულისხმება -h პარამეტრი. პროგრამის დასრულების სტატუსია 0, თუ დამთხვევა მოიძებნა; 1, თუ დამთხვევა არ მოიძებნა; და 2, თუ დაფიქსირდა შეცდომა. თუ -E ან -# არ არის მითითებული, შეირჩევა, მხოლოდ, ზუსტი დამთხვევები.

source: PATTERN is a POSIX extended regular expression (ERE) with the TRE extensions. See tre(7) for a complete description.
ka: PATTERN წარმოადგენს POSIX-ის გაფართოებულ რეგულარულ გამოსახულებას (ERE) TRE გაფართოებებით. სრული აღწერისთვის იხილეთ tre(7).

source: Report bugs to:
ka: შეცდომების შესახებ მიწერეთ:

source: Error reading from %s: %s
ka: %s-იდან წაკითხვის შეცდომა: %s

source: Cannot use -B when reading from standard input.
ka: სტანდარტული შეყვანიდან კითხვისას პარამეტრს -B ვერ გამოიყენებთ.

source: (standard input)
ka: (სტანდარტული შეტანა)

source: Copyright (c) 2001-2009 Ville Laurikari <vl@iki.fi>.
ka: საავტორო უფლებები დაცულია (c) 2001-2009 Ville Laurikari <vl@iki.fi>.

source: %s: invalid option --%s
ka: %s: არასწორი პარამეტრი --%s

source: Error in search pattern
ka: შეცდომა ძებნის ნიმუშში

source: Error in record delimiter pattern
ka: შეცდომა ჩანაწერის გამყოფის ნიმუშში

source: Record delimiter pattern must not match an empty string
ka: ჩანაწერის გამყოფი ნიმუში ცარიელ სტრიქონს არ უნდა ემთხვეოდეს
